# <center> Issues when working with Dataframe</center>

In [2]:
import pandas as pd
import numpy as np

# Show all dataframe

In [3]:
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)

# Switch off warnings

In [4]:
pd.options.mode.chained_assignment = None  # switch off warnings

In [2]:
df = pd.read_csv("sampledata.csv")

In [3]:
df.head(1)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800

# Copy Dataframe

### <center>new_dataframe = old_dataframe.copy()</center>

In [4]:
df2 = df.copy()
df2.head(1)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800

# Rename Dataframe

### <center>new_dataframe = old_dataframe.rename(columns=name_of_the_columns, inplace =True)</center>

In [10]:
df.columns

Index(['budget', 'genres', 'homepage', 'id', 'keywords', 'original_language',
       'original_title', 'overview', 'popularity', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'vote_average',
       'vote_count'],
      dtype='object')

In [ ]:
TMDB_TO_IMDB_SIMPLE_EQUIVALENCIES = {
    'budget': 'budget',
    'genres': 'genres',
    'revenue': 'gross',
    'title': 'movie_title',
    'runtime': 'duration',
    'original_language': 'language',
    'keywords': 'plot_keywords',
    'vote_count': 'num_voted_users'}
df.rename(columns=TMDB_TO_IMDB_SIMPLE_EQUIVALENCIES,inplace=True)

# To_Datetime

In [12]:
df['release_date']

0       2009-12-10
1       2007-05-19
2       2015-10-26
3       2012-07-16
4       2012-03-07
5       2007-05-01
6       2010-11-24
7       2015-04-22
8       2009-07-07
9       2016-03-23
10      2006-06-28
11      2008-10-30
12      2006-06-20
13      2013-07-03
14      2013-06-12
15      2008-05-15
16      2012-04-25
17      2011-05-14
18      2012-05-23
19      2014-12-10
20      2012-06-27
21      2010-05-12
22      2013-12-11
23      2007-12-04
24      2005-12-14
25      1997-11-18
26      2016-04-27
27      2012-04-11
28      2015-06-09
29      2012-10-25
           ...
4773    1994-09-13
4774    1971-01-01
4775    2002-09-20
4776    1997-01-19
4777    2002-01-15
4778    2009-08-14
4779    1990-07-27
4780    2015-10-02
4781    2013-02-14
4782    2003-01-01
4783    2015-01-16
4784    2005-01-17
4785    2014-09-05
4786    2009-03-14
4787    2011-10-26
4788    1972-03-12
4789    2004-09-01
4790    2000-09-08
4791    2007-01-01
4792    1997-11-06
4793    2004-04-11
4794    2012-01-20
4795    1995-09-09
4796    2004-10-08
4797    2005-03-12
4798    1992-09-04
4799    2011-12-26
4800    2013-10-13
4801    2012-05-03
4802    2005-08-05
Name: release_date, Length: 4803, dtype: object

In [14]:
pd.to_datetime(df['release_date']).apply(lambda x: x.year)

0       2009.0
1       2007.0
2       2015.0
3       2012.0
4       2012.0
5       2007.0
6       2010.0
7       2015.0
8       2009.0
9       2016.0
10      2006.0
11      2008.0
12      2006.0
13      2013.0
14      2013.0
15      2008.0
16      2012.0
17      2011.0
18      2012.0
19      2014.0
20      2012.0
21      2010.0
22      2013.0
23      2007.0
24      2005.0
25      1997.0
26      2016.0
27      2012.0
28      2015.0
29      2012.0
         ...
4773    1994.0
4774    1971.0
4775    2002.0
4776    1997.0
4777    2002.0
4778    2009.0
4779    1990.0
4780    2015.0
4781    2013.0
4782    2003.0
4783    2015.0
4784    2005.0
4785    2014.0
4786    2009.0
4787    2011.0
4788    1972.0
4789    2004.0
4790    2000.0
4791    2007.0
4792    1997.0
4793    2004.0
4794    2012.0
4795    1995.0
4796    2004.0
4797    2005.0
4798    1992.0
4799    2011.0
4800    2013.0
4801    2012.0
4802    2005.0
Name: release_date, Length: 4803, dtype: float64

# Json type

In [32]:
import json

### Json loads and Json Dump
* dumps takes an object and produces a string
* load would take a file-like object, read the data from that object, and use that string to create an object:

In [35]:
# dumps:
a = {'foo': 3}
json.dumps(a)

'{"foo": 3}'

In [36]:
# # load:
# with open('file.son') as fh:
#     a = json.load(fh)

In [45]:
df.genres[0]

'[{"id": 28, "name": "Action"}, {"id": 12, "name": "Adventure"}, {"id": 14, "name": "Fantasy"}, {"id": 878, "name": "Science Fiction"}]'

In [46]:
type(df.genres)

pandas.core.series.Series

In [47]:
df.genres=df.genres.apply(json.loads)

In [48]:
type(df.genres)

pandas.core.series.Series

In [49]:
'|'.join([x['name'] for x in df.genres[0]])

'Action|Adventure|Fantasy|Science Fiction'

The SyntaxError: unexpected EOF while parsing means that the end of your source code was reached before all code blocks were completed.

# Convert to datetime

In [ ]:
# convert date strings to datetime objects and create 'year' field
matches.loc[:,'date'] = pd.to_datetime(matches.loc[:,'date'].astype(str), format='%Y-%m-%d')

# Create 'year' field

In [ ]:
matches['year'] = [x.year for x in matches['date']]

# Sort_value and inplace

In [ ]:
matches.sort_values('date',inplace=True)

# Add two columns

In [ ]:
matches['Total goals'] = [x + y for x,y in zip(matches['team1Score'],matches['team2Score'])]

# Pivot table = Create new dataframe

In [5]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
...                          "bar", "bar", "bar", "bar"],
...                    "B": ["one", "one", "one", "two", "two",
...                          "one", "one", "two", "two"],
...                    "C": ["small", "large", "large", "small",
...                          "small", "large", "small", "small",
...                          "large"],
...                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7]})

In [6]:
df

     A    B      C  D
0  foo  one  small  1
1  foo  one  large  2
2  foo  one  large  2
3  foo  two  small  3
4  foo  two  small  3
5  bar  one  large  4
6  bar  one  small  5
7  bar  two  small  6
8  bar  two  large  7

In [10]:
from pandas import pivot_table

In [11]:
table = pivot_table(df, values='D', index=['A', 'B'],
...                     columns=['C'], aggfunc=np.sum)

In [12]:
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

# Add 2 dataframe

In [ ]:
matches = matches1.append(matches2)

# Add 2 dataframe and create a new df

In [ ]:
teamperf = pd.concat([matches1,matches2])

# Apply function with lamda

In [ ]:
def countryMapping(row):
    if row == 'FRG':
        val = 'GER'
    elif row == 'TCH':
        val = 'CZE'
    elif row == 'URS':
        val = 'RUS'
    elif row == 'SCG':
        val = 'SRB'
    elif row == 'ZAI':
        val = 'COD'
    else:
        val = row
    return val

In [ ]:
teamperf['team1'] = teamperf['team1'].apply(lambda x: countryMapping(x))
teamperf['team2'] = teamperf['team2'].apply(lambda x: countryMapping(x))

# The occurrence frequency

In [ ]:
# what is the occurrence frequency for match scores?
scores1 = matches[matches['team1Score']>=matches['team2Score']]
scores2 = matches[matches['team2Score']>matches['team1Score']]
scores2[['team1Score','team2Score']] = scores2[['team2Score','team1Score']]
scores = pd.concat([scores1,scores2])[['team1Score','team2Score']]
scorefreq = scores.groupby(['team1Score','team2Score']).size().reset_index()
scorefreq.columns.values[2] = 'Number'
scorefreq.sort_values('Number',ascending=False).head(15)

# Change name column

In [ ]:
gsfreq.columns.values[1] = 'Freq'